In [1]:
import pandas as pd

In [2]:
df_bigData = pd.read_csv("StudentsPerformance.xls")

In [3]:
df_bigData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [4]:
df0 = pd.read_csv("school_and_country_table.csv")

In [5]:
df0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 818 entries, 0 to 817
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   school_name  818 non-null    object
 1   country      818 non-null    object
dtypes: object(2)
memory usage: 12.9+ KB

In [6]:
df1 = pd.read_csv("cwurData.csv")
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2200 entries, 0 to 2199
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   world_rank            2200 non-null   int64
 1   institution           2200 non-null   object
 2   country               2200 non-null   object
 3   national_rank         2200 non-null   int64
 4   quality_of_education  2200 non-null   int64
 5   alumni_employment     2200 non-null   int64
 6   quality_of_faculty    2200 non-null   int64
 7   publications          2200 non-null   int64
 8   influence             2200 non-null   int64
 9   citations             2200 non-null   int64
 10  broad_impact          2000 non-null   float64
 11  patents               2200 non-null   int64
 12  score                 2200 non-null   float64
 13  year                  2200 non-null   int64
dtypes: float64(2), int64(10), object(2)
memory usage: 240.8+ KB

In [7]:
df1=df1.drop(['country'],axis=1)

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2200 entries, 0 to 2199
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   world_rank            2200 non-null   int64
 1   institution           2200 non-null   object
 2   national_rank         2200 non-null   int64
 3   quality_of_education  2200 non-null   int64
 4   alumni_employment     2200 non-null   int64
 5   quality_of_faculty    2200 non-null   int64
 6   publications          2200 non-null   int64
 7   influence             2200 non-null   int64
 8   citations             2200 non-null   int64
 9   broad_impact          2000 non-null   float64
 10  patents               2200 non-null   int64
 11  score                 2200 non-null   float64
 12  year                  2200 non-null   int64
dtypes: float64(2), int64(10), object(1)
memory usage: 223.6+ KB

In [9]:
df_bigData = pd.concat([df_bigData, df0], axis="columns")

In [10]:
df_bigData.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
 8   school_name                  818 non-null    object
 9   country                      818 non-null    object
dtypes: int64(3), object(7)
memory usage: 85.9+ KB

In [11]:
df_bigData

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,school_name,country
0,female,group B,bachelor's degree,standard,none,72,72,74,Harvard University,United States of America
1,female,group C,some college,standard,completed,69,90,88,California Institute of Technology,United States of America
2,female,group B,master's degree,standard,none,90,95,93,Massachusetts Institute of Technology,United States of America
3,male,group A,associate's degree,free/reduced,none,47,57,44,Stanford University,United States of America
4,male,group C,some college,standard,none,76,78,75,Princeton University,United States of America
...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,NaN,NaN
996,male,group C,high school,free/reduced,none,62,55,55,NaN,NaN
997,female,group C,high school,free/reduced,completed,59,71,65,NaN,NaN
998,female,group D,some college,standard,completed,68,78,77,NaN,NaN
999,female,group D,some college,free/reduced,none,77,86,86,NaN,NaN

In [22]:
d={
    'location_from': ['Karachi'],
    'location_to': ['Lahore'],
    'budget (millions)': [1],
    'study_group': ['pre_law'],
    'father_occupation': ['doctor'],
    'mother_occupation': ['doctor'],
    'language_preference': ['english'],
    'degree_program': ['BSCS'],
    'hobby':['reading'],
    'extracarriculars':['football']
    }

extention = pd.DataFrame(data=d)

In [30]:
extention.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   location_from        1 non-null      object
 1   location_to          1 non-null      object
 2   budget (millions)    1 non-null      int64
 3   study_group          1 non-null      object
 4   father_occupation    1 non-null      object
 5   mother_occupation    1 non-null      object
 6   language_preference  1 non-null      object
 7   degree_program       1 non-null      object
 8   hobby                1 non-null      object
 9   extracarriculars     1 non-null      object
dtypes: int64(1), object(9)
memory usage: 208.0+ bytes

In [24]:
df_bigData = pd.concat([df_bigData, extention], axis="columns")

In [26]:
df_bigData.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 0 to 999
Data columns (total 20 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
 8   school_name                  818 non-null    object
 9   country                      818 non-null    object
 10  location_from                1 non-null      object
 11  location_to                  1 non-null      object
 12  budget (millions)            1 non-null      float64
 13  study_group                  1 non-null      object
 14  father_occupation            1 non-null      object
 15  mother_occupation            1 non-null      object
 16  language_preference          1 non-null      object
 17  degree_program               1 non-null      object
 18  hobby                        1 non-null      object
 19  extracarriculars             1 non-null      object
dtypes: float64(1), int64(3), object(16)
memory usage: 164.1+ KB

In [34]:
df_bigData.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,school_name,country,location_from,location_to,budget (millions),study_group,father_occupation,mother_occupation,language_preference,degree_program,hobby,extracarriculars
0,female,group B,bachelor's degree,standard,none,72,72,74,Harvard University,United States of America,Karachi,Lahore,1.0,pre_law,doctor,doctor,english,BSCS,reading,football
1,female,group C,some college,standard,completed,69,90,88,California Institute of Technology,United States of America,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,female,group B,master's degree,standard,none,90,95,93,Massachusetts Institute of Technology,United States of America,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,male,group A,associate's degree,free/reduced,none,47,57,44,Stanford University,United States of America,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,male,group C,some college,standard,none,76,78,75,Princeton University,United States of America,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN